RhinoInside.Revit API Documentation
GeometryEncoder.ToArc Method (Arc)
 Converts the specified Rhino.Geometry.Arc to an equivalent of Autodesk.Revit.DB.Arc.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Arc ToArc(
	this Rhino.Geometry.Arc arc
)
@staticmethod
def ToArc(
	arc: Rhino.Geometry.Arc
) -> Autodesk.Revit.DB.Arc
Parameters
arc
Type: Rhino.Geometry.Arc
Rhino arc to convert.
Return Value
Type: Autodesk.Revit.DB.Arc
Revit arc that is equivalent to the provided Rhino arc.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Arc. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToArc(Arc) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Arc revitArc = rhinoArc.ToArc();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_arc = rhino_arc.ToArc()    # type: DB.Arc
 Using ToArc(Arc) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Arc revitArc = GeometryEncoder.ToArc(rhinoArc);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_arc = GE.ToArc(rhino_arc)    # type: DB.Arc
See Also
Reference
GeometryEncoder Class
ToArc Overload
RhinoInside.Revit.Convert.Geometry Namespace